[
  {
    "title": "General App Usage",
    "subtitle": "Understanding Howth Golf Live",
    "steps": [
      {
        "title": "Competition scores",
        "data": "Found to the right of the date on competition cards- howth data is always on the left!"
      },
      {
        "title": "Refreshing",
        "data": "There is no need- all data is always up to date."
      },
      {
        "title": "Competition details",
        "data": "At the top middle of a specific competition page: location, date & lastly the time."
      },
      {
        "title": "Searching for a competition",
        "data": "In the Competitions page, hit the magnifying glass icon in the top right & enter search text."
      },
      {
        "title": "More hole data",
        "data": "In a competition page, you can click on an individual hole to see extra information or (if you have access) update scores/hole data."
      }
    ]
  },
  {
    "title": "Competition Score Access",
    "subtitle": "Low level permissions",
    "steps": [
      {
        "title": "Go to the competitions page",
        "data": "Click the home icon in the top right corner of this page to return to the Competitions page."
      },
      {
        "title": "Locate your competition",
        "data": "Scroll through the current & archived competitions to find your competition."
      },
      {
        "title": "Click on the competition",
        "data": "Tap anywhere on it's card to enter page with the details of your competition."
      },
      {
        "title": "Show the text field",
        "data": "Click the admin icon in the top right corner of the page. A text field should appear."
      },
      {
        "title": "Enter your code",
        "data": "Click on the text field that has appeared & type in your competition code."
      },
      {
        "title": "Submit entered code",
        "data": "Click the check icon in the top right corner of the page. The text field vanishes."
      }
    ]
  },
  {
    "title": "Gaining Admin Privileges",
    "subtitle": "Highest level permissions",
    "steps": [
      {
        "title": "Go to the app help page",
        "data": "Click the arrow icon in the top left corner of this page to go back to the App Help page."
      },
      {
        "title": "Show the text field",
        "data": "Click the admin icon in the top right corner of the page. A text field should appear."
      },
      {
        "title": "Enter your admin code",
        "data": "Click on the text field that has appeared & type in your admin code."
      },
      {
        "title": "Submit entered code",
        "data": "Click the check icon in the top right corner of the page. The text field vanishes."
      }
    ]
  },
  {
    "title": "Updating a Competition",
    "subtitle": "For admins & team managers.",
    "steps": [
      {
        "title": "Add a hole",
        "data": "In a competition page, click the button at the bottom. Fill out the required information and hit the check icon in the top right."
      },
      {
        "title": "Remove a hole",
        "data": "Click on the hole you want to remove. In the drop-down that appears, click the delete icon (below the edit icon) in the bottom left."
      },
      {
        "title": "Modify a hole",
        "data": "Click on the hole you want to modify. In the drop-down that appears, click the edit icon (above the delete icon) in the top left."
      },
      {
        "title": "Updating hole numbers / scores",
        "data": "Click on the hole you want to modify. In the drop-down that appears, there will be 3 sets of plus/minus icons. They are vertically aligned with the number that they modify."
      }
    ]
  },
  {
    "title": "Competition Management",
    "subtitle": "For admins only.",
    "steps": [
      {
        "title": "Add a competition",
        "data": "In the competitions page, click the button at the bottom. Fill out the required information and hit the check icon in the top right."
      },
      {
        "title": "Remove a competition",
        "data": "In the competitions page, each card will have a remove icon on the bottom right of it. Click this icon to remove the associated competition."
      },
      {
        "title": "Modify a competition",
        "data": "In the competitions page, each card will have a edit icon on the top right of it. Click this icon to modify the associated competition."
      },
      {
        "title": "Add a manager",
        "data": "In a competition page, the last competition detail is a 6-digit code. Give this to the future-manager to type into their app to gain access to the associated competition while the competition is current."
      }
    ]
  }
]