[
  {
    "title": "App Usage - Q&A",
    "subtitle": "Understanding Howth Golf Live",
    "steps": [
      {
        "title": "Where are the competition scores",
        "data": "The competition scores are found to the right of the date on competition cards- howth data is always on the left!"
      },
      {
        "title": "How do I refresh",
        "data": "Refreshing is done automatically- all data is always up to date as long as you have an internet connection."
      },
      {
        "title": "Where are the competition details",
        "data": "Tap a competition card to enter that competition page. The competition details are found at the top center (of this page) in the following order: location, date & lastly the time."
      },
      {
        "title": " How do I search for a competition",
        "data": "In the Competitions page, tap the magnifying glass icon in the top right & enter search text."
      },
      {
        "title": "Where can I find additional details for a match/player",
        "data": "In a competition page, you can tap on a player's name to see extra information. If you have access to the competition, you can update scores/hole data here."
      }
    ]
  },
  {
    "title": "Competition Score Access",
    "subtitle": "Low level permissions",
    "steps": [
      {
        "title": "Go to the competitions page",
        "data": "Tap the home icon in the top right corner of this page to return to the Competitions page."
      },
      {
        "title": "Locate your competition",
        "data": "Scroll through the current & archived competitions to find your competition."
      },
      {
        "title": "Tap on the competition",
        "data": "Tap anywhere on it's card to enter page with the details of your competition."
      },
      {
        "title": "Show the text box",
        "data": "Tap the admin icon in the top right corner of the page. A text box should appear."
      },
      {
        "title": "Enter your code",
        "data": "Tap on the text box that has appeared & type in your competition code."
      },
      {
        "title": "Submit entered code",
        "data": "Tap the check icon in the top right corner of the page. The text box vanishes."
      }
    ]
  },
  {
    "title": "Gaining Admin Privileges",
    "subtitle": "Highest level permissions",
    "steps": [
      {
        "title": "Go to the app help page",
        "data": "Tap the arrow icon in the top left corner of this page to go back to the App Help page."
      },
      {
        "title": "Show the text box",
        "data": "Tap the admin icon in the top right corner of the page. A text box should appear."
      },
      {
        "title": "Enter your admin code",
        "data": "Tap on the text box that has appeared & type in your admin code."
      },
      {
        "title": "Submit entered code",
        "data": "Tap the check icon in the top right corner of the page. The text box vanishes."
      }
    ]
  },
  {
    "title": "Updating a Competition",
    "subtitle": "For admins & team managers.",
    "steps": [
      {
        "title": "Add a hole",
        "data": "In a competition page, tap the button at the bottom. Fill out the required information and tap the check icon in the top right."
      },
      {
        "title": "Remove a hole",
        "data": "Tap on the hole you want to remove. In the drop-down that appears, tap the delete icon (below the edit icon) in the bottom left."
      },
      {
        "title": "Modify a hole",
        "data": "Tap on the hole you want to modify. In the drop-down that appears, tap the edit icon (above the delete icon) in the top left."
      },
      {
        "title": "Updating hole numbers / scores",
        "data": "Tap on the hole you want to modify. In the drop-down that appears, there will be 3 sets of plus/minus icons. They are vertically aligned with the number that they modify."
      }
    ]
  },
  {
    "title": "Competition Management",
    "subtitle": "For admins only.",
    "steps": [
      {
        "title": "Add a competition",
        "data": "In the competitions page, tap the button at the bottom. Fill out the required information and tap the check icon in the top right."
      },
      {
        "title": "Remove a competition",
        "data": "In the competitions page, each card will have a remove icon on the bottom right of it. Tap this icon to remove the associated competition."
      },
      {
        "title": "Modify a competition",
        "data": "In the competitions page, each card will have a edit icon on the top right of it. Tap this icon to modify the associated competition."
      },
      {
        "title": "Add a manager",
        "data": "In a competition page, the last competition detail is a 6-digit code. Give this to the future-manager to type into their app to gain access to the associated competition while the competition is current."
      }
    ]
  }
]